In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [4]:
def calc_sum(x):
    return(x.sum())

data = {
  "x": [50, 40, 30],
  "y": [300, 1112, 42]
}

df = pd.DataFrame(data)

x = df.apply(calc_sum)

print(x)

x     120
y    1454
dtype: int64

In [5]:
df.apply(np.cumsum)

     x     y
0   50   300
1   90  1412
2  120  1454

# Reading excel file and performing groupby

In [119]:
df=pd.read_excel('./Fruit.xlsx')
print(df)

        Fruit  Sweetness  Soureness Fruit Type
0       Lemon          1          9       Sour
1   Grapfruit          2          8       Sour
2      Orange          3          7       Sour
3   Raspberry          2          8       Sour
4      Cherry          6          4      Sweet
5      Banana          9          1      Sweet
6      Grapes          8          2      Sweet
7  Watermelon          9          1      Sweet
8     Avacado          1          1        NaN
9  Strawberry          5          5       Sour

In [ ]:
df.groups()
df.groupby

In [120]:
import pandas as pd 
  
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj','Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd','B.Tech', 'B.com', 'Msc', 'MA']} 
    
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
  
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [117]:
grp = df.groupby('Name')
for name, group in grp:
    print(name)
    print(group)
    print()

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

In [116]:
grp = df.groupby(['Name', 'Qualification'])
for name, group in grp:
    print(name)
    print(group)
    print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

In [115]:
grp = df.groupby('Name')
grp.get_group('Jai')
grp = df.groupby(['Name', 'Qualification'])
grp.get_group(('Jai', 'Msc'))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

In [ ]:
grp = df.groupby('Name')
sc = lambda x: (x - x.mean()) / x.std()*10 # z-score
grp.transform(sc)

In [123]:
grp=df.groupby('Name')
grp.filter(lambda x: len(x)>=2)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc

In [ ]:
# grp1 = df.groupby('Name')

# grp1.aggregate(np.sum)

- crosstab

In [31]:
df=pd.read_excel('survey.xls')
print(df)

      Name Nationality     Sex  Age Handedness
0    Kathy         USA  Female   23      Right
1    Linda         USA  Female   18      Right
2    Peter         USA    Male   19      Right
3     John         USA    Male   22       Left
4   Fatima   Bangadesh  Female   31       Left
5    Kadir   Bangadesh    Male   25       Left
6   Dhaval       India    Male   35       Left
7   Sudhir       India    Male   31       Left
8   Parvir       India    Male   37      Right
9      Yan       China  Female   52      Right
10    Juan       China  Female   58       Left
11   Liang       China    Male   43       Left

In [34]:
pd.crosstab(df.Nationality,df.Age)

Age          18  19  22  23  25  31  35  37  43  52  58
Nationality
Bangadesh     0   0   0   0   1   1   0   0   0   0   0
China         0   0   0   0   0   0   0   0   1   1   1
India         0   0   0   0   0   1   1   1   0   0   0
USA           1   1   1   1   0   0   0   0   0   0   0

In [35]:
pd.crosstab(df.Sex,df.Age)

Age     18  19  22  23  25  31  35  37  43  52  58
Sex
Female   1   0   0   1   0   1   0   0   0   1   1
Male     0   1   1   0   1   1   1   1   1   0   0

In [38]:
pd.crosstab(df.Sex,df.Handedness)

Handedness  Left  Right
Sex
Female         2      3
Male           5      2

# Normalize

# Pivot

In [8]:
import pandas as pd
df = pd.DataFrame({'Name': ['Farhan', 'Vrinda', 'Kohli'], 
      'Course': ['Masters', 'Graduate', 'Graduate'], 
      'Age': [27, 23, 21]}) 
df

     Name    Course  Age
0  Farhan   Masters   27
1  Vrinda  Graduate   23
2   Kohli  Graduate   21

In [24]:
df.pivot(index='Name', columns='Course', values='Age')

Course  Graduate  Masters
Name
Farhan       NaN     27.0
Kohli       21.0      NaN
Vrinda      23.0      NaN

In [25]:
df = pd.DataFrame({"A": ["table", "table", "table", "table", "table",
                         "chair", "chair", "chair", "chair"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "Price": [500, 1500, 1500, 1000, 1500, 1250, 500, 1000, 2500],
                   "Discount": [100, 200, 200, 500, 600, 600, 800, 900, 900]})
df

       A    B      C  Price  Discount
0  table  one  small    500       100
1  table  one  large   1500       200
2  table  one  large   1500       200
3  table  two  small   1000       500
4  table  two  small   1500       600
5  chair  one  large   1250       600
6  chair  one  small    500       800
7  chair  two  small   1000       900
8  chair  two  large   2500       900

In [26]:
table=pd.pivot_table(df,values='Discount',index=['A','B'],columns=['C'],aggfunc="sum")
table

C          large   small
A     B
chair one  600.0   800.0
      two  900.0   900.0
table one  400.0   100.0
      two    NaN  1100.0

In [37]:
table=pd.pivot_table(df,values='Price',index=['A','B'],columns=['C'],aggfunc={'Price':sum})
table

C:\Users\ASUS\AppData\Local\Temp\ipykernel_23868\542556228.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  table=pd.pivot_table(df,values='Price',index=['A','B'],columns=['C'],aggfunc={'Price':sum})

C           large   small
A     B
chair one  1250.0   500.0
      two  2500.0  1000.0
table one  3000.0   500.0
      two     NaN  2500.0

# Melt

In [31]:
pd.melt(df,id_vars=['A'],value_vars=['Price'])

       A variable  value
0  table    Price    500
1  table    Price   1500
2  table    Price   1500
3  table    Price   1000
4  table    Price   1500
5  chair    Price   1250
6  chair    Price    500
7  chair    Price   1000
8  chair    Price   2500

In [34]:
df.stack()

0  A           table
   B             one
   C           small
   Price         500
   Discount      100
1  A           table
   B             one
   C           large
   Price        1500
   Discount      200
2  A           table
   B             one
   C           large
   Price        1500
   Discount      200
3  A           table
   B             two
   C           small
   Price        1000
   Discount      500
4  A           table
   B             two
   C           small
   Price        1500
   Discount      600
5  A           chair
   B             one
   C           large
   Price        1250
   Discount      600
6  A           chair
   B             one
   C           small
   Price         500
   Discount      800
7  A           chair
   B             two
   C           small
   Price        1000
   Discount      900
8  A           chair
   B             two
   C           large
   Price        2500
   Discount      900
dtype: object

In [36]:
df.unstack()

A         0    table
          1    table
          2    table
          3    table
          4    table
          5    chair
          6    chair
          7    chair
          8    chair
B         0      one
          1      one
          2      one
          3      two
          4      two
          5      one
          6      one
          7      two
          8      two
C         0    small
          1    large
          2    large
          3    small
          4    small
          5    large
          6    small
          7    small
          8    large
Price     0      500
          1     1500
          2     1500
          3     1000
          4     1500
          5     1250
          6      500
          7     1000
          8     2500
Discount  0      100
          1      200
          2      200
          3      500
          4      600
          5      600
          6      800
          7      900
          8      900
dtype: object

In [38]:
pd.to_datetime('2003-07-01 4:10pm')

Timestamp('2003-07-01 16:10:00')

In [39]:
pd.Timestamp('2003/07/01 4:10am')

Timestamp('2003-07-01 04:10:00')

In [46]:
from pandas import Timestamp

Timestamp("20180115 15:45:00")

Timestamp('2018-01-15 15:45:00')

In [47]:
pd.to_datetime("7/8/1982",dayfirst=True)

Timestamp('1982-08-07 00:00:00')

In [50]:
pd.DatetimeIndex(["2003-07-01","2003-07-01","2003-07-01"],dtype='datetime64[ns]',freq=None)

DatetimeIndex(['2003-07-01', '2003-07-01', '2003-07-01'], dtype='datetime64[ns]', freq=None)

In [52]:
import pandas

df = pandas.DataFrame(columns=['todate','fromdate','ans'])

df.todate = [pandas.Timestamp('2014-01-24 13:03:12.050000'), 
             pandas.Timestamp('2014-01-27 11:57:18.240000'), 
             pandas.Timestamp('2014-01-23 10:07:47.660000')]

df.fromdate = [pandas.Timestamp('2014-01-26 23:41:21.870000'), 
               pandas.Timestamp('2014-01-27 15:38:22.540000'), 
               pandas.Timestamp('2014-01-23 18:50:41.420000')]

df.ans = (df.fromdate-df.todate).astype('timedelta64[ns]')
print(df)
df.ans

                   todate                fromdate                    ans
0 2014-01-24 13:03:12.050 2014-01-26 23:41:21.870 2 days 10:38:09.820000
1 2014-01-27 11:57:18.240 2014-01-27 15:38:22.540 0 days 03:41:04.300000
2 2014-01-23 10:07:47.660 2014-01-23 18:50:41.420 0 days 08:42:53.760000

0   2 days 10:38:09.820000
1   0 days 03:41:04.300000
2   0 days 08:42:53.760000
Name: ans, dtype: timedelta64[ns]

In [ ]:
df['diff']

In [54]:
from datetime import datetime
a=pd.date_range(start='1/1/2022', end='1/08/2022', freq='H')
a

C:\Users\ASUS\AppData\Local\Temp\ipykernel_23868\3412217192.py:2: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  a=pd.date_range(start='1/1/2022', end='1/08/2022', freq='H')

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-01 01:00:00',
               '2022-01-01 02:00:00', '2022-01-01 03:00:00',
               '2022-01-01 04:00:00', '2022-01-01 05:00:00',
               '2022-01-01 06:00:00', '2022-01-01 07:00:00',
               '2022-01-01 08:00:00', '2022-01-01 09:00:00',
               ...
               '2022-01-07 15:00:00', '2022-01-07 16:00:00',
               '2022-01-07 17:00:00', '2022-01-07 18:00:00',
               '2022-01-07 19:00:00', '2022-01-07 20:00:00',
               '2022-01-07 21:00:00', '2022-01-07 22:00:00',
               '2022-01-07 23:00:00', '2022-01-08 00:00:00'],
              dtype='datetime64[ns]', length=169, freq='h')

In [56]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': [2, 3, 4], 'c': [1, 3, 5]},
                 index=['tiger', 'zebra', 'cow'])
df

       a  b  c
tiger  1  2  1
zebra  2  3  3
cow    3  4  5

- Skewness

In [57]:
df.skew()

a    0.0
b    0.0
c    0.0
dtype: float64

In [59]:
df.skew(axis=1,numeric_only=True)

tiger    1.732051
zebra   -1.732051
cow      0.000000
dtype: float64

- Kurtosis

In [65]:
df = pd.DataFrame({'a': [1, 2], 'b': [3, 4], 'c': [3, 4], 'd': [1, 2]},index=['cat', 'dog'])
print(df)

     a  b  c  d
cat  1  3  3  1
dog  2  4  4  2

In [63]:
df.kurt(axis=1) #-6.0 indicate platykurtic , ie. distribution is too flat

cat   -6.0
dog   -6.0
dtype: float64

In [73]:
df = pd.DataFrame({'a': [1, 2, 2, 3], 'b': [3, 4, 4, 4]},index=['cat', 'dog', 'dog', 'mouse'])
print(df)
df.kurt(axis=None).round(6) #4.0 indicate leptokurtic ie, distribution is highly peaked

       a  b
cat    1  3
dog    2  4
dog    2  4
mouse  3  4

-0.988693

# Merge , Join

In [74]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)


frames = [df1, df2, df3]

In [75]:
left = pd.DataFrame({'person_id': ['GT01', 'GT02'], 'score_test': [34, 29]})

right = pd.DataFrame({'person_id': ['GT01', 'GT02'], 'score_final': [65, 89]})

In [76]:
pd.merge(left,right,on='person_id')

  person_id  score_test  score_final
0      GT01          34           65
1      GT02          29           89

In [89]:
d1 = {'Id': ['A1', 'A2', "A3", 'A4','A5'],
 'Name':['Vivek', 'Rahul', 'Gaurav', 'Ankit','Vishakha'], 
 'Age':[27, 24, 22, 32, 28],} 
 
d2 = {'Id': ['A1', 'A2', 'A3', 'A4'],
 'Address':['Delhi', 'Gurgaon', 'Noida', 'Pune'], 
 'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

In [84]:
pd.merge(df1,df2)

   Id    Name  Age  Address Qualification
0  A1   Vivek   27    Delhi         Btech
1  A2   Rahul   24  Gurgaon           B.A
2  A3  Gaurav   22    Noida          Bcom
3  A4   Ankit   32     Pune        B.hons

In [80]:
pd.merge(df1,df2,how="left")

   Id      Name  Age  Address Qualification
0  A1     Vivek   27    Delhi         Btech
1  A2     Rahul   24  Gurgaon           B.A
2  A3    Gaurav   22    Noida          Bcom
3  A4     Ankit   32     Pune        B.hons
4  A5  Vishakha   28      NaN           NaN

In [81]:
pd.merge(df1,df2,how="right")

   Id    Name  Age  Address Qualification
0  A1   Vivek   27    Delhi         Btech
1  A2   Rahul   24  Gurgaon           B.A
2  A3  Gaurav   22    Noida          Bcom
3  A4   Ankit   32     Pune        B.hons

In [82]:
pd.merge(df1,df2,how="inner")

   Id    Name  Age  Address Qualification
0  A1   Vivek   27    Delhi         Btech
1  A2   Rahul   24  Gurgaon           B.A
2  A3  Gaurav   22    Noida          Bcom
3  A4   Ankit   32     Pune        B.hons

In [83]:
pd.merge(df1,df2,how="outer")

   Id      Name  Age  Address Qualification
0  A1     Vivek   27    Delhi         Btech
1  A2     Rahul   24  Gurgaon           B.A
2  A3    Gaurav   22    Noida          Bcom
3  A4     Ankit   32     Pune        B.hons
4  A5  Vishakha   28      NaN           NaN

In [90]:
pd.merge(left, right, on='person_id')

  person_id  score_test  score_final
0      GT01          34           65
1      GT02          29           89

in below the id name is different in both

In [91]:
d1 = {'Id': ['A1', 'A2', "A3", 'A4','A5'],
 'Name':['Vivek', 'Rahul', 'Gaurav', 'Ankit','Vishakha'], 
 'Age':[27, 24, 22, 32, 28],} 
 
d2 = {'ID': ['A1', 'A2', 'A3', 'A4'],
 'Address':['Delhi', 'Gurgaon', 'Noida', 'Pune'], 
 'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

In [87]:
pd.merge(df1,df2,left_on='Id',right_on='ID',how="left")

   Id      Name  Age   ID  Address Qualification
0  A1     Vivek   27   A1    Delhi         Btech
1  A2     Rahul   24   A2  Gurgaon           B.A
2  A3    Gaurav   22   A3    Noida          Bcom
3  A4     Ankit   32   A4     Pune        B.hons
4  A5  Vishakha   28  NaN      NaN           NaN

- Join

In [92]:
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K5', 'K3', 'K4', 'K2'],'A': ['A0', 'A1', 'A5', 'A3', 'A4', 'A2']})

df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2'],'B': ['B0', 'B1', 'B2']})

In [95]:
df1.join(df2,lsuffix='_l',rsuffix='_r')

  key_l   A key_r    B
0    K0  A0    K0   B0
1    K1  A1    K1   B1
2    K5  A5    K2   B2
3    K3  A3   NaN  NaN
4    K4  A4   NaN  NaN
5    K2  A2   NaN  NaN

In [93]:
df1.join(df2,lsuffix='_l',rsuffix='_r',how='inner')

  key_l   A key_r   B
0    K0  A0    K0  B0
1    K1  A1    K1  B1
2    K5  A5    K2  B2

In [96]:
m1 = pd.DataFrame({
'Name': ['Alex','Amy','Allen','Alice','Ayoung'],
'subject_id':['sub1','sub2','sub4','sub6','sub5'],
'Marks_scored':[98,90,87,69,78]},
 index=[1,2,3,4,5])

m2 = pd.DataFrame({
'Name': ['Billy','Brian','Bran','Bryce','Betty'],
'subject_id':['sub2','sub4','sub3','sub6','sub5'],
'Marks_scored':[89,80,79,97,88]},
 index=[1,2,3,4,5])

In [ ]:
m1.append(m2,verify_integrity=True)

# SERIES SAMPLING

- Time Series Resampling

In [101]:
df=pd.read_csv("./apples.csv",parse_dates=["date"],index_col="date")
df[:10]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_23868\3618092917.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df=pd.read_csv("./apples.csv",parse_dates=["date"],index_col="date")

                      close         volume    open    high       low
date
2024-05-21 16:00:00  192.23     46,541,444  191.72  197.18  191.4501
2018-11-13 00:00:00  192.23  46725710.0000  191.63  197.18  191.4501
2018-11-12 00:00:00  194.17  50991030.0000  199.00  199.85  193.7900
2018-11-09 00:00:00  204.47  34317760.0000  205.55  206.01  202.2500
2018-11-08 00:00:00  208.49  25289270.0000  209.98  210.12  206.7500
2018-11-07 00:00:00  209.95  33291640.0000  205.97  210.06  204.1300
2018-11-06 00:00:00  203.77  31774720.0000  201.92  204.72  201.6900
2018-11-05 00:00:00  201.59  66072170.0000  204.30  204.39  198.1700
2018-11-02 00:00:00  207.48  91046560.0000  209.55  213.65  205.4300
2018-11-01 00:00:00  222.22  52954070.0000  219.05  222.36  216.8100

In [105]:
a=df.close.resample('ME').mean()
a

date
2017-11-30    172.090769
2017-12-31    171.891500
2018-01-31    174.005238
2018-02-28    167.638947
2018-03-31    174.496190
                 ...
2024-01-31           NaN
2024-02-29           NaN
2024-03-31           NaN
2024-04-30           NaN
2024-05-31    192.230000
Freq: ME, Name: close, Length: 79, dtype: float64

In [104]:
a=df.close.resample('W').mean()
a

date
2017-11-19    171.1280
2017-11-26    173.2625
2017-12-03    171.9080
2017-12-10    169.4280
2017-12-17    172.5660
                ...
2024-04-28         NaN
2024-05-05         NaN
2024-05-12         NaN
2024-05-19         NaN
2024-05-26    192.2300
Freq: W-SUN, Name: close, Length: 341, dtype: float64

z-score

# using transform function in groupby

TypeError: Could not convert string 'Aligarh' to numeric